tap "azure/kubelogin"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "supabase/tap"
brew "awscli"
brew "azure-cli"
brew "git"
brew "glib"
brew "hyperfine"
brew "shared-mime-info"
brew "libheif"
brew "llvm"
brew "mise"
brew "python@3.10"
brew "rclone"
brew "starship"
brew "stow"
brew "watch"
brew "wget"
brew "azure/kubelogin/kubelogin"
brew "supabase/tap/supabase"
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "google-cloud-sdk"
vscode "a-h.templ"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "gamunu.opentofu"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "vadimcn.vscode-lldb"
vscode "wmaurer.change-case"
